export const camryData = {
  name: 'Model Toyota Camry',
  startColor: 'img/camry/black.png',
  characteristics: {
    engine: {
      title: 'Двигун',
      types: [
        { name: 'engine2500', label: '2.5L Inline-4 engine', value: '76200' },
        { name: 'engine3500', label: '3.5L V6 engine', value: '80200' },
        {
          name: 'engine2000',
          label: '2.0L Turbocharged engine',
          value: '90300',
        },
      ],
    },
    package: {
      title: 'Пакет',
      types: [
        { name: 'packageComfort', label: 'Comfort', value: '100800' },
        { name: 'packageElegance', label: 'Elegance', value: '124560' },
        { name: 'packagePrestige', label: 'Prestige', value: '562560' },
        { name: 'packagePremium', label: 'Premium', value: '824560' },
      ],
    },

    transmission: {
      title: 'Коробка передач',
      types: [
        { name: 'auto', label: 'Автомат', value: '23000' },
        { name: 'manual', label: 'Ручна', value: '12000' },
      ],
    },
  },
  colors: [
    { className: 'colorWhite', imgPath: 'img/camry/white.png' },
    { className: 'colorBlack active', imgPath: 'img/camry/black.png' },
    { className: 'colorSilver', imgPath: 'img/camry/silver.png' },
    { className: 'colorBrown', imgPath: 'img/camry/brown.png' },
    { className: 'colorBlue', imgPath: 'img/camry/blue.png' },
    { className: 'colorRed', imgPath: 'img/camry/red.png' },
  ],
  variants: [
    {
      title: 'Екстер′єр',
      content: [
        {
          configName: 'Comfort',
          configProperties: [
            { name: 'Сіра нижня решітка радіатора', value: false },
            { name: 'Чорна глянцева нижня решітка радіатора', value: true },
            {
              name: 'Декоративні сріблясті вставки переднього бампера',
              value: true,
            },
            {
              name: 'Декоративні хромовані вставки переднього бампера',
              value: false,
            },
            { name: 'Глянцеві вставки центральної стійки', value: false },
            { name: 'Панорамний дах з люком', value: false },
          ],
        },
        {
          configName: 'Elegance',
          configProperties: [
            { name: 'Сіра нижня решітка радіатора', value: false },
            { name: 'Чорна глянцева нижня решітка радіатора', value: true },
            {
              name: 'Декоративні сріблясті вставки переднього бампера',
              value: true,
            },
            {
              name: 'Декоративні хромовані вставки переднього бампера',
              value: false,
            },
            { name: 'Глянцеві вставки центральної стійки', value: false },
            { name: 'Панорамний дах з люком', value: false },
          ],
        },
        {
          configName: 'Prestige',
          configProperties: [
            { name: 'Сіра нижня решітка радіатора', value: true },
            { name: 'Чорна глянцева нижня решітка радіатора', value: false },
            {
              name: 'Декоративні сріблясті вставки переднього бампера',
              value: false,
            },
            {
              name: 'Декоративні хромовані вставки переднього бампера',
              value: true,
            },
            { name: 'Глянцеві вставки центральної стійки', value: true },
            { name: 'Панорамний дах з люком', value: false },
          ],
        },
        {
          configName: 'Premium',
          configProperties: [
            { name: 'Сіра нижня решітка радіатора', value: true },
            { name: 'Чорна глянцева нижня решітка радіатора', value: false },
            {
              name: 'Декоративні сріблясті вставки переднього бампера',
              value: false,
            },
            {
              name: 'Декоративні хромовані вставки переднього бампера',
              value: true,
            },
            { name: 'Глянцеві вставки центральної стійки', value: true },
            { name: 'Панорамний дах з люком', value: true },
          ],
        },
      ],
    },
    {
      title: 'Фари',
      content: [
        {
          configName: 'Comfort',
          configProperties: [
            {
              name: 'Світлодіодні фари головного світла з денними ходовими вогнями',
              value: true,
            },
            {
              name: 'Світлодіодні фари головного світла з характерними денними ходовими вогнями',
              value: false,
            },
            {
              name: 'Автоматичний коректор кута нахилу фар головного світла',
              value: true,
            },
            {
              name: 'Світлодіодні задні ліхтарі з характерними габаритними вогнями',
              value: false,
            },
          ],
        },
        {
          configName: 'Elegance',
          configProperties: [
            {
              name: 'Світлодіодні фари головного світла з денними ходовими вогнями',
              value: true,
            },
            {
              name: 'Світлодіодні фари головного світла з характерними денними ходовими вогнями',
              value: false,
            },
            {
              name: 'Автоматичний коректор кута нахилу фар головного світла',
              value: true,
            },
            {
              name: 'Світлодіодні задні ліхтарі з характерними габаритними вогнями',
              value: false,
            },
          ],
        },
        {
          configName: 'Prestige',
          configProperties: [
            {
              name: 'Світлодіодні фари головного світла з денними ходовими вогнями',
              value: true,
            },
            {
              name: 'Світлодіодні фари головного світла з характерними денними ходовими вогнями',
              value: false,
            },
            {
              name: 'Автоматичний коректор кута нахилу фар головного світла',
              value: true,
            },
            {
              name: 'Світлодіодні задні ліхтарі з характерними габаритними вогнями',
              value: false,
            },
          ],
        },
        {
          configName: 'Premium',
          configProperties: [
            {
              name: 'Світлодіодні фари головного світла з денними ходовими вогнями',
              value: false,
            },
            {
              name: 'Світлодіодні фари головного світла з характерними денними ходовими вогнями',
              value: true,
            },
            {
              name: 'Автоматичний коректор кута нахилу фар головного світла',
              value: true,
            },
            {
              name: 'Світлодіодні задні ліхтарі з характерними габаритними вогнями',
              value: false,
            },
          ],
        },
      ],
    },
    {
      title: 'Засоби пасивної безпеки',
      content: [
        {
          configName: 'Comfort',
          configProperties: [
            {
              name: 'Подушки безпеки фронтальні для водія та переднього пасажира',
              value: true,
            },
            { name: 'Подушки безпеки для колін водія', value: false },
            {
              name: 'Подушки безпеки бокові для водія та переднього пасажира',
              value: true,
            },
            { name: 'Захисні бокові шторки передні та задні', value: true },
          ],
        },
        {
          configName: 'Elegance',
          configProperties: [
            {
              name: 'Подушки безпеки фронтальні для водія та переднього пасажира',
              value: true,
            },
            { name: 'Подушки безпеки для колін водія', value: false },
            {
              name: 'Подушки безпеки бокові для водія та переднього пасажира',
              value: true,
            },
            { name: 'Захисні бокові шторки передні та задні', value: true },
          ],
        },
        {
          configName: 'Prestige',
          configProperties: [
            {
              name: 'Подушки безпеки фронтальні для водія та переднього пасажира',
              value: true,
            },
            { name: 'Подушки безпеки для колін водія', value: true },
            {
              name: 'Подушки безпеки бокові для водія та переднього пасажира',
              value: true,
            },
            { name: 'Захисні бокові шторки передні та задні', value: true },
          ],
        },
        {
          configName: 'Premium',
          configProperties: [
            {
              name: 'Подушки безпеки фронтальні для водія та переднього пасажира',
              value: true,
            },
            { name: 'Подушки безпеки для колін водія', value: true },
            {
              name: 'Подушки безпеки бокові для водія та переднього пасажира',
              value: true,
            },
            { name: 'Захисні бокові шторки передні та задні', value: true },
          ],
        },
      ],
    },
    {
      title: 'Система кондиціонування',
      content: [
        {
          configName: 'Comfort',
          configProperties: [
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            {
              name: 'Незалежне регулювання температури для 2-го ряду сидінь',
              value: false,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: true },
            { name: 'Іонізатор повітря nanoe', value: false },
          ],
        },
        {
          configName: 'Elegance',
          configProperties: [
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            {
              name: 'Незалежне регулювання температури для 2-го ряду сидінь',
              value: false,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: true },
            { name: 'Іонізатор повітря nanoe', value: false },
          ],
        },
        {
          configName: 'Prestige',
          configProperties: [
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            {
              name: 'Незалежне регулювання температури для 2-го ряду сидінь',
              value: false,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: true },
            { name: 'Іонізатор повітря nanoe', value: true },
          ],
        },
        {
          configName: 'Premium',
          configProperties: [
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            {
              name: 'Незалежне регулювання температури для 2-го ряду сидінь',
              value: true,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: true },
            { name: 'Іонізатор повітря nanoe', value: true },
          ],
        },
      ],
    },
  ],
  review: {
    positions: [
      {
        name: 'Технології',
        descr: [
          {
            title: 'Безпека',
            image: 'img/camry/1.jpg',
            text: [
              'Розвинена система пасивної безпеки робить нову Тойоту Камрі одним з найбезпечніших автомобілів у своєму класі. Також штатно встановлені протиугінні засоби.',
              'Активні системи безпеки моделі дозволяють впевнено утримувати автомобіль на вибраній траєкторії руху на дорожньому полотні різної якості (ABS+BA+EBD), уникати пробуксовування (TRC), стабілізувати авто (VSC). Передбачена система допомоги при старті на підйомі (НАС) та постійний моніторинг тиску в шинах (TPMS).',
            ],
          },
          {
            title: 'Технології',
            image: 'img/camry/2.jpg',
            text: [
              'На нову Тойота Камрі встановлений покращений комплекс систем активної безпеки та допомоги водієві Toyota Safety Sense, який, крім технологій відстеження стану водія, попередження про небезпечне наближення до пішоходів та перешкод, розпізнавання знаків дорожнього руху, автоматичного управління дальнім світлом, отримав кілька нових функцій. Вони допомагають водієві виявляти зустрічні автомобілі в денний час, надають екстрену допомогу в управлінні та при поворотах на перехресті, вмикаючи гальмування в разі появи перешкоди.',
              'Покращено систему утримання авто в смузі руху - тепер машина точніше виявляє смугу, швидше переналаштовується після зміни смуги руху, має великий кут повороту для зменшення турбулентності при обгоні вантажівок, раніше попереджає водія про поворот і забезпечує більше зусилля на кермо',
              'Адаптивний круїз контроль дозволяє дотримуватися обраного водієм стилю їзди, реагуючи на зміни дорожньої ситуації.',
              'Передбачені системи допомоги при паркуванні, безключовий запуску двигуна та індукційний зарядний пристрій Qi',
            ],
          },
          {
            title: 'Двигун',
            image: 'img/camry/3.jpg',
            text: [
              "Нову Toyota Camry можна купити з оновленим 4-циліндровим бензиновим атмосферним двигуном Dynamic Force з робочим об'ємом 2,487 куб. см. На чотирьох циліндрах, розташованих в ряд, встановлена 16-клапанна система 16-DOHC, Dual VVT-i (впуск - VVT-iE/випуск - VVT-i) з регульованою системою фаз газорозподілу. На кожному циліндрі встановлені дві форсунки - прямого та розподіленого уприскування, тому двигун демонструє високу ефективність в будь-яких умовах руху, не допускаючи провалів і впевнено прискорюючи автомобіль в разі потреби.",
              'Завдяки високому тепловому ККД (досягає 40%) у Тойоти Камрі знижено витрату пального при збільшеній до 207 к.с. потужності.',
            ],
          },
        ],
      },
      {
        name: "Інтер'єр",
        descr: [
          {
            title: "Інтер'єр",
            image: 'img/camry/4.jpg',
            text: [
              'Салон нової Toyota Camry відповідає очікуванням комфорту й вишуканої розкоші. Сидіння авто оздоблені комбінованою шкірою бежевого або чорного кольору. Перфорація в формі ялинки покращує вентиляцію. Також можна купити Тойота Камрі з сидіннями з чорної синтетичної шкіри зі вставками з тканини.',
              'На панелі приладів розташований кольоровий мультиінформаційний дисплей розміром 4,2/7,0 дюймів. Передбачено можливість регулювання яскравості підсвічування панелі.',
              'Панель приладів, консоль та карти дверей прикрашені новими візерунками. Мультифункціональне кермо й селектор АКПП оздоблені шкірою, підлокітник - синтетичною шкірою. Передбачена фонова ілюмінація центральної консолі, дверних ручок та простору для ніг переднього ряду сидінь. На порогах передніх та задніх дверей встановлені металеві накладки.',
            ],
          },
          {
            title: 'Мультимедіа',
            image: 'img/camry/5.jpg',
            text: [
              "Автомобіль отримав оновлену мультимедійну систему з 7,0/9,0-дюймовим кольоровим інформаційним дисплеєм. Покращені її програмне забезпечення та реакція на команди водія. Передбачена підтримка інтеграції зі смартфоном Apple CarPlay та Android Auto.",
              "Для зручності користування мультимедійним комплексом створені нові органи управління у вигляді обертових коліщаток та фізичних клавіш.",
              "На додаток до потужного комунікаційного комплексу, що містить навігаційну систему GPS, з'єднання по Bluetooth або USB, аудіосистема Toyota з сенсорним дисплеєм та акустичною системою JBL дозволить водієві й пасажирам насолодитися чистим звучанням музики під час поїздки.",
            ],
          },
          
        ],
      },
            {
        name: "Екстер'єр",
        descr: [
          {
            title: "Екстер'єр",
            image: 'img/camry/6.jpg',
            text: [
              "Дизайн нової Toyota Camry сміливо можна назвати революційним. Зовнішній вигляд авто поєднує шарм представницького 4-дверного седана та стрімкість спортивного боліда. Виразний оновлений передній бампер з решіткою радіатора (доступна в чорному й темно-сірому кольорах) з хромованими або сріблястими бічними елементами надають зовнішності автомобіля виразних рис. В кришку багажника вбудований спойлер, що підкреслює спортивний характер машини.",
              "Залежно від комплектації на авто можуть бути встановлені 17-дюймові колеса з п'ятьма здвоєними V-подібними спицями або колеса діаметром 18 дюймів з подвійними яскравими спицями, що поєднуються зі скрученими спицями чорного кольору.",
              "Власник може купити Toyota Camry в одному з восьми варіантів забарвлення кузова. Також доступна версія авто зі скляним панорамним дахом.",
            ],
          },
          {
            title: 'Зовнішній вигляд',
            image: 'img/camry/7.jpg',
            text: [
              "Зовнішній вигляд Toyota Camry - результат поєднання революційного дизайну та технологічної переваги моделі. Аеродинамічні контури, великі колеса на фірмових дисках, рельєфна лінія бортів, що відокремлює вікна від нижньої частини кузова та вбудований в кришку багажника спойлер підкреслюють характер автомобіля, а новий бампер з агресивними кутами решітки радіатора говорить про беззастережну перевагу Тойота Камрі на дорозі."
            ],
          },
          
        ],
      },
      {
        name: "Комфорт",
        descr: [
          {
            title: "Комфорт",
            image: 'img/camry/8.jpg',
            text: [
              "Водію та пасажирам Toyota Camry надано найвищий рівень комфорту.",
              "Мультифункціональне кермо обладнано системою підігріву й регулюється по вильоту та висоті за допомогою електроприводу. Сидіння мають регульовані функції підігріву та вентиляції, також безліч регулювань положення й підтримки. Мікроклімат в салоні підтримує система клімат-контролю з незалежним регулюванням для зон водія та пасажира, для заднього ряду сидінь передбачена незалежна система обігріву.",
              "Залежно від версії моделі сидіння заднього ряду складаються в пропорції 60:40 або 40:20:40, встановлений багатофункціональний підлокітник з утримувачами склянок.",
              "Для зовнішніх дзеркал, колонки керма та сидіння водія передбачено функцію запам'ятовування двох обраних положень",
            ],
          },
          {
            title: 'Ходова частина',
            image: 'img/camry/9.jpg',
            text: [
              "На Toyota Camry встановлена передньопривідна трансмісія з 8-ступеневою автоматичною коробкою перемикання передач. Передня підвіска - незалежна, пружинна зі стійками Макферсон та стабілізатором поперечної стійкості, задня - незалежна, пружинна з двома здвоєними поперечними важелями та стабілізатором поперечної стійкості. Така конструкція гарантує комфорт пасажирам, а також відмінну стійкість й маневровість автомобіля.",
            ],
          },
          
        ],
      },
    ],
  },
  questions: [
    {
      title:"Чим відрізняється ціна на авто в наявності та ціна авто у виробництво?",
      content: "Вартість кожної моделі вказано з двома цінами. Перша ціна - на автомобілі, які знаходяться на території України, друга ціна - на автомобілі, які можуть бути замовлені у виробництво.",
    },
    {
      title:"Які додаткові платежі передбачаються при купівлі нового авто?",
      content: "Комісія банку при оплаті через касу, обов'язкове страхування ОСЦПВ, реєстрація автомобіля, яка включає оплату пенсійного фонду, реєстраційного збору та номерного знаку.",
    },
    {
      title:"Чи можна здати своє авто з пробігом у якості першого внеску за нове авто?",
      content: "Так, обирайте нову Toyota, залиште своє авто з пробігом нашим спеціалістам Трейд-ін для безкоштовної оцінки, погодьте вартість автомобіля з пробігом. Далі ви можете використати цю сумму в якості першого внеску за нову Toyota",
    },
    {
      title:"Чи можна оформити кредит на залишок суми доплати після здачі авто в Трейд-ін?",
      content: "Так, наші спеціалісти оцінять та погодять з вами вартість авто з пробігом, сума вартості буде зарахована як перший внесок за нову Toyota. А на решту вартості ви зможете обрати найвигідніші кредитні умови від наших фінансових партнерів та оформити кредитування.",
    },
    {
      title:"Який термін та умови гарантії на авто?",
      content: "На нові автомобілі Toyota розповсюджується гарантія - 3 роки або 100 тис. км, у залежності від того, що настає раніше.",
    },
    {
      title:"Як часто потрібно проходити технічне обслуговування авто?",
      content: "Технічне обслуговування Toyota Camry проводиться що 15000 км пробігу, або один раз на рік, у залежності від того що настане раніше. Детальніше про роботи та вартості обслуговування кожної моделі дізнавайтесь у розділі Регламент технічного обслуговування",
    },
  ]
};
