export const corollaData = {
  name: 'Model Toyota Corolla',
  startColor: 'img/corolla/black.jpg',
  characteristics: {
    engine: {
      title: 'Двигун',
      types: [
        { name: 'engine1400', label: '1.4 л', value: '56200' },
        { name: 'engine1600', label: '1.6 л', value: '62200' },
        { name: 'engine2000', label: '2.0 л', value: '78300' },
      ],
    },
    package: {
      title: 'Пакет',
      types: [
        { name: 'packageActive', label: 'Active', value: '0' },
        { name: 'packageActivePlus', label: 'Active Plus', value: '24560' },
      ],
    },

    transmission: {
      title: 'Коробка передач',
      types: [
        { name: 'auto', label: 'Автомат', value: '23000' },
        { name: 'manual', label: 'Ручна', value: '12000' },
      ],
    },
  },
  colors: [
    { className: 'colorWhite', imgPath: 'img/corolla/white.jpg' },
    { className: 'colorBlack active', imgPath: 'img/corolla/black.jpg' },
    { className: 'colorBronz', imgPath: 'img/corolla/bronz.jpg' },
    { className: 'colorSilver', imgPath: 'img/corolla/silver.jpg' },
    { className: 'colorGray', imgPath: 'img/corolla/gray.jpg' },
    { className: 'colorRed', imgPath: 'img/corolla/red.png' },
  ],
  variants: [
    {
      title: 'Екстер′єр',
      content: [
        {
          configName: 'City',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: false },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Live 2023',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: false },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Active 2023',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Style',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: true,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: true,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'GR Sport',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: true,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: true,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
      ],
    },
    {
      title: 'Фари',
      content: [
        {
          configName: 'City',
          configProperties: [
            {
              name: 'Прожекторні галогенові фари головного світла',
              value: true,
            },
            {
              name: 'Прожекторні світлодіодні фари головного світла',
              value: false,
            },
            {
              name: 'Механічний коректор кута нахилу передніх фар',
              value: true,
            },
            { name: 'Світлодіодні вогні денного світла', value: true },
            { name: 'Світлодіодні передні протитуманні фари', value: false },
            { name: 'Світлодіодний протитуманний ліхтар', value: true },
            {
              name: 'Світлодіодні задні габаритні ліхтарі та стоп-сигнали',
              value: true,
            },
            { name: 'Світлодіодні задні ліхтарі', value: false },
            { name: 'Датчик освітлення', value: true },
            {
              name: 'Система головного освітлення з функцією супровідного освітлення «Follow me home»',
              value: true,
            },
          ],
        },
        {
          configName: 'Live 2023',
          configProperties: [
            {
              name: 'Прожекторні галогенові фари головного світла',
              value: true,
            },
            {
              name: 'Прожекторні світлодіодні фари головного світла',
              value: false,
            },
            {
              name: 'Механічний коректор кута нахилу передніх фар',
              value: true,
            },
            { name: 'Світлодіодні вогні денного світла', value: true },
            { name: 'Світлодіодні передні протитуманні фари', value: true },
            { name: 'Світлодіодний протитуманний ліхтар', value: true },
            {
              name: 'Світлодіодні задні габаритні ліхтарі та стоп-сигнали',
              value: true,
            },
            { name: 'Світлодіодні задні ліхтарі', value: false },
            { name: 'Датчик освітлення', value: true },
            {
              name: 'Система головного освітлення з функцією супровідного освітлення «Follow me home»',
              value: true,
            },
          ],
        },
        {
          configName: 'Active 2023',
          configProperties: [
            {
              name: 'Прожекторні галогенові фари головного світла',
              value: true,
            },
            {
              name: 'Прожекторні світлодіодні фари головного світла',
              value: false,
            },
            {
              name: 'Механічний коректор кута нахилу передніх фар',
              value: true,
            },
            { name: 'Світлодіодні вогні денного світла', value: true },
            { name: 'Світлодіодні передні протитуманні фари', value: false },
            { name: 'Світлодіодний протитуманний ліхтар', value: true },
            {
              name: 'Світлодіодні задні габаритні ліхтарі та стоп-сигнали',
              value: true,
            },
            { name: 'Світлодіодні задні ліхтарі', value: false },
            { name: 'Датчик освітлення', value: true },
            {
              name: 'Система головного освітлення з функцією супровідного освітлення «Follow me home»',
              value: true,
            },
          ],
        },
        {
          configName: 'Style',
          configProperties: [
            {
              name: 'Прожекторні галогенові фари головного світла',
              value: false,
            },
            {
              name: 'Прожекторні світлодіодні фари головного світла',
              value: true,
            },
            {
              name: 'Механічний коректор кута нахилу передніх фар',
              value: true,
            },
            { name: 'Світлодіодні вогні денного світла', value: true },
            { name: 'Світлодіодні передні протитуманні фари', value: false },
            { name: 'Світлодіодний протитуманний ліхтар', value: true },
            {
              name: 'Світлодіодні задні габаритні ліхтарі та стоп-сигнали',
              value: false,
            },
            { name: 'Світлодіодні задні ліхтарі', value: false },
            { name: 'Датчик освітлення', value: true },
            {
              name: 'Система головного освітлення з функцією супровідного освітлення «Follow me home»',
              value: true,
            },
          ],
        },
        {
          configName: 'GR Sport',
          configProperties: [
            {
              name: 'Прожекторні галогенові фари головного світла',
              value: false,
            },
            {
              name: 'Прожекторні світлодіодні фари головного світла',
              value: true,
            },
            {
              name: 'Механічний коректор кута нахилу передніх фар',
              value: true,
            },
            { name: 'Світлодіодні вогні денного світла', value: true },
            { name: 'Світлодіодні передні протитуманні фари', value: false },
            { name: 'Світлодіодний протитуманний ліхтар', value: true },
            {
              name: 'Світлодіодні задні габаритні ліхтарі та стоп-сигнали',
              value: false,
            },
            { name: 'Світлодіодні задні ліхтарі', value: false },
            { name: 'Датчик освітлення', value: true },
            {
              name: 'Система головного освітлення з функцією супровідного освітлення «Follow me home»',
              value: true,
            },
          ],
        },
      ],
    },
    {
      title: 'Скло',
      content: [
        {
          configName: 'City',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: false },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Live 2023',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: false },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Active 2023',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: false,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: false,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'Style',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: true,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: true,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
        {
          configName: 'GR Sport',
          configProperties: [
            {
              name: 'Тоновані стекла задніх дверей та заднє скло',
              value: true,
            },
            {
              name: 'Передні склоочисники з інтервалом роботи, що регулюється',
              value: true,
            },
            { name: 'Склоочисники з сенсором дощу', value: true },
            { name: 'Обігрів заднього скла з автотаймером', value: true },
            {
              name: 'Обігрів лобового скла в зоні покою щіток склоочисників з автотаймером',
              value: true,
            },
            {
              name: 'Електросклопідйомники передніх та задніх вікон (травмобезпечні, з автоматичною функцією)',
              value: true,
            },
          ],
        },
      ],
    },
    {
      title: 'Система кондиціонування',
      content: [
        {
          configName: 'City',
          configProperties: [
            { name: 'Кондиціонер', value: true },
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: false,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: false },
          ],
        },
        {
          configName: 'Live 2023',
          configProperties: [
            { name: 'Кондиціонер', value: true },
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: false },
          ],
        },
        {
          configName: 'Active 2023',
          configProperties: [
            { name: 'Кондиціонер', value: false },
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: false },
          ],
        },
        {
          configName: 'Style',
          configProperties: [
            { name: 'Кондиціонер', value: false },
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: false },
          ],
        },
        {
          configName: 'GR Sport',
          configProperties: [
            { name: 'Кондиціонер', value: false },
            {
              name: 'Клімат-контроль з незалежним регулюванням температури зон водій/передній пасажир',
              value: true,
            },
            { name: 'Дефлектори обдуву для 2-го ряду сидінь', value: false },
          ],
        },
      ],
    },
  ],
};
